{"pages":[{"url":"http://yanjiong.wang/page/about","text":"我曾经历了许许多多，现在，我似乎明白了什么是幸福，在乡下恬静的隐居，尽可能对人们做些简单而有用的善事，尽管那些人们并不习惯我为他们做了这些，做一份真正有用的工作，最后休息，享受大自然，读书，听音乐，爱周围的每一个人。这就是我对幸福的诠释。在这些之上，有你为伴，也许还有我们的孩子，一个男人还能再渴望些什么呢？ ——列夫 托尔斯泰《家庭幸福》 教育 2002-2006(学士) 北京邮电大学, 理学院, 数学与应用数学专业 北京邮电大学, 电信工程院, 通信工程专业 2006-2011(博士) 北京邮电大学, 网络技术研究院/网络与交换技术国家重点实验室, 密码学专业 工作 2006-2011 西门子（中国）有限公司, 西门子中国研究院 2012-2014（博士后） 上海交通大学，电子信息与电气工程学院，计算机科学与技术专业 2011-2014 普元信息技术股份有限公司, 资深架构师（云计算大数据方向） 2014-2015 平安健康保险股份有限公司, 资深架构师 2015-Now 普元信息技术股份有限公司, 技术总监（持续交付、云计算、实时流数据处理方向） 专利 ZL200610081402 / 采用小区动态划分技术的对等网络系统实现方法 (由于申请人主动放弃，夭折) CN201210555384 / 基于云计算架构实现复杂事件处理的系统及其方法 (已授权) [CN201310713949] / 复杂事件处理云平台事件分析引擎容量评估的系统及方法 (已申请) [CN201410279588] / 基于在线计费环境实现模拟收发设备信令的系统及方法 (已申请) 媒体 新民晚报 2012年9月24日 解放日报 2013年4月14日","tags":"pages","title":"About"},{"url":"http://yanjiong.wang/article/2015/10-19/ITSystemTraditionalVsInternet","text":"从单个计算机到互联网 在中国大陆，计算机有一个更为形象的名字，电脑。从字面可以看出，它是一件帮助人类进行思考的机器。但决定计算机思考什么，如何进行思考的，就是程序。 把人类脑袋中的可重复的、机械性的脑力劳动，变为机器可重复执行的程序，这个过程就是软件过程。 在计算机诞生之初，它所要解决的问题是科学计算，也因此得名计算机。可以想象，一个计算机的计算能力是有限的，但有了计算机网络，使得成千上万，乃至上亿的计算机可以协同工作，并形成更大的计算能力，也就为解放人类机械性脑里劳动，带来了想象空间。计算机也从科学家手里，走进了如今的平常百姓家。 要让计算机为普通百姓服务，从衣食住行医多方面提高人们的生活质量，其先决条件是信息化。信息化，是将一件事情或者一个物品或者一个时间或者定量货币，以数字化的方式精确量化下来。随着计算机硬件的不断发展，整个社会的信息化成本逐步降低。从而，人与人的通信、交易过程方便的可以信息化，并在此基础之上形成如今的各种面相个人的互联网产品：例如，社交应用、电子商务、第三方支付、个人信贷平台。 现今的互联网特征 现在的互联网公司是以轻资产行业——除了计算机及网络本身，不需要其他生产资料的行业——为切入点，以数字化逐步改变了人的沟通方式、人的消费方式，乃至生活方式。 如今互联网公司普遍具有以下2个特征： 面向个人消费者（B2C） 由于用户基数大，以计算机（含网络和存储）为生产资料的互联网公司，为单个用户服务的边际成本低，并且规模效应大。 轻资产距离实体经济较远 无论是蓬勃发展的社交应用，电子商务平台，还是个人金融平台，都远离消费品制造本身。即便是电商平台，与实体密切相关的是自身仓储信息化，物流环节则是和合作伙伴公司进行信息系统对接。电商平台，绕开了消费品诞生最为复杂的生产制造环节。 传统行业的企业信息系统 在传统行业里，有三大社会基础设施类行业的系统建设规模较大，它们是金融、电信、能源行业，每个企业所拥有的应用系统数量是成百上千，单个企业所使用的计算机规模也在数万至百万，或者更多。 放眼传统金融行业，例如银行、证券、保险等领域，信息系统也是企业的核心生产资料。与第三方支付平台不同，商业银行有着社会基础设施的不可替代性，导致了其信息系统建设理念与互联网公司有着天壤之别，因为数据既是货币，所有交付行为都通过系统完成，所以其宗旨是在以账务为核心的会计准侧下，确保稳定、可靠零差错。 电信、能源，都是以国家级重资产投资为核心的基础行业，其业务模式较为稳定，行业竞争性弱，主要受国家政策影响大。这类行业的信息系统主要解决两个方面的问题，重资产（数亿的电信设备、电力设备）的信息化管理维护，面向个人与企业的业务营销，账务核销。 软件交付的过程 通常一个具有人机交互功能（也就是带可视化操作界面）的企业信息系统，称之为应用系统。一个最简单的应用系统会包含前端可视化操作界面（Web）、后端业务逻辑（Service）、底层数据库（Database）三个组成部分。将这样一个应用系统交付给企业内部的员工进行使用，以传统的软件工程方式进行建设，需要经过软件生命周期的6大阶段：需求分析、架构设计、编码实现、测试验证、上线运行、后期维护。而被非IT行业所广为熟知的程序员，则是编码实现这一环节的生力军，这一环节负责把业务需求变为代码，从而实现系统的业务功能。","tags":"EnterpriceArchitect","title":"IT系统对于传统企业与互联网企业的价值"},{"url":"http://yanjiong.wang/article/2015/10-18/MacOSXEnvironment","text":"Mail Mail.app Browser Chrome (Extensions) SwitchyOmega 1Password AdBlock Plus Evernote Chrome (App) Postman Gliffy ProcessOn Firefox (Adds-on) Firebug FoxyProxy Firegesture 1Password AdBlock Plus Evernote RSS Reeder 3 Editor & IDE Sublime Text Mou / MacDown BBEditor IntelliJ IDEA PyCharm Version Contrl SourceTree Cornerstone DataBase Navicat Notebook Evernote Security 1password Efficiency Alfred Powerpack Spectacle iTerm2 zsh + oh-my-zsh Homebrew + homebrew cask RamDisk Automator Shell Socks5 socat / netcat Synchronize Dropbox Calendar LunarCal Fantastical Remote SecureCRT CoRD","tags":"Knowledge","title":"Mac OS X环境"},{"url":"http://yanjiong.wang/article/2015/10-16/pelican-toc-plugin","text":"插件准备 使用 extract_toc 执行 git clone https://github.com/getpelican/pelican-plugins.git 修改配置文件 文件： pelicanconf.py 指定插件目录 PLUGIN_PATHS = ['<your_path>/getpelican/pelican-plugins'] 启用插件 PLUGINS = ['extract_toc'] Markdown标记 插入 [TOC] 标签，例如： title: Pelican TOC Plugin date: 2015-10-16 modified: 2015-10-17 tags: pelican category: pelican [TOC] ### 插件准备","tags":"Pelican","title":"Pelican TOC Plugin"}]}